# 5) одну последовательность сортируем пузрьковой сортировкой (но еще добавляем, что меняются местами одинаковые числа), вторую, такую же по длине, сортируем синхронно и пошагово с первой
# 8) задача по типу нахождения наименьшей длины пути. Там продают билеты очереди. Очередь разбивается на тройки,
#       вводится количество троек и 3 цифры: время продажи 1 билета, 2 билетов и 3 билетов. Нужно посчитать за какое наименьшее время можно продать очереди билеты.
# 9)ханойская башня, с условием, что нельзя переносить сразу с 1 на 3, но с 1 на 2 и потом на 3 можно.
#     и еще одну я не помню
